In [1]:
import pandas as pd
import numpy as np

In [4]:
df = pd.read_csv('movie_scores.csv')
df

  first_name last_name   age gender  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0      m              8.0              10.0
1        NaN       NaN   NaN    NaN              NaN               NaN
2       Hugh   Jackman  51.0      m              NaN               NaN
3      Oprah   Winfrey  66.0      f              6.0               8.0
4       Emma     Stone  31.0      f              7.0               9.0

In [7]:
#checking and selecting for null values
print(df.isnull()) #true if the column is 'null' else false
print(df.notnull()) #true if the column is 'not null' else false

   first_name  last_name    age  gender  pre_movie_score  post_movie_score
0       False      False  False   False            False             False
1        True       True   True    True             True              True
2       False      False  False   False             True              True
3       False      False  False   False            False             False
4       False      False  False   False            False             False
   first_name  last_name    age  gender  pre_movie_score  post_movie_score
0        True       True   True    True             True              True
1       False      False  False   False            False             False
2        True       True   True    True            False             False
3        True       True   True    True             True              True
4        True       True   True    True             True              True

In [8]:
print(df['first_name'])
print(df['first_name'].notnull())

print((df['pre_movie_score'].isnull()) & df.gender.notnull())

0      Tom
1      NaN
2     Hugh
3    Oprah
4     Emma
Name: first_name, dtype: object
0     True
1    False
2     True
3     True
4     True
Name: first_name, dtype: bool
0    False
1    False
2     True
3    False
4    False
dtype: bool

In [10]:
#dropna
print(df.dropna()) #drop row if any column contains null
print(df.dropna(thresh=1)) #any row with atleast one non-null value is retained

  first_name last_name   age gender  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0      m              8.0              10.0
3      Oprah   Winfrey  66.0      f              6.0               8.0
4       Emma     Stone  31.0      f              7.0               9.0
  first_name last_name   age gender  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0      m              8.0              10.0
2       Hugh   Jackman  51.0      m              NaN               NaN
3      Oprah   Winfrey  66.0      f              6.0               8.0
4       Emma     Stone  31.0      f              7.0               9.0

In [11]:
print(df.dropna(axis=1)) #drop a column

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [12]:
df.dropna(thresh=4,axis=1) #a column must have atleast 4 non null values to be retained

  first_name last_name   age gender
0        Tom     Hanks  63.0      m
1        NaN       NaN   NaN    NaN
2       Hugh   Jackman  51.0      m
3      Oprah   Winfrey  66.0      f
4       Emma     Stone  31.0      f

In [15]:
df.fillna('New Value!')
df['first_name'] = df['first_name'].fillna('Empty')
df

  first_name last_name   age gender  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0      m              8.0              10.0
1      Empty       NaN   NaN    NaN              NaN               NaN
2       Hugh   Jackman  51.0      m              NaN               NaN
3      Oprah   Winfrey  66.0      f              6.0               8.0
4       Emma     Stone  31.0      f              7.0               9.0

In [17]:
df = pd.read_csv('tips.csv')
df.head()

,total_bill,tip,gender,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3.560330e+15,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4.478070e+15,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6.011810e+15,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4.676140e+15,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4.832730e+15,Sun2251

In [18]:
# Groupby functionality:
df_grouped = df.groupby('gender')
df_grouped

In [19]:
mean_tip_by_gender = df_grouped['tip'].mean()
mean_tip_by_gender

gender
Female    2.833448
Male      3.089618
Name: tip, dtype: float64

In [22]:
print(df_grouped['tip'].min())
print(df_grouped['tip'].max())
print(df_grouped['tip'].std())
print(df_grouped['tip'].var())
print(df_grouped['tip'].count())
print(df_grouped['tip'].sum())

gender
Female    1.0
Male      1.0
Name: tip, dtype: float64
gender
Female     6.5
Male      10.0
Name: tip, dtype: float64
gender
Female    1.159495
Male      1.489102
Name: tip, dtype: float64
gender
Female    1.344428
Male      2.217424
Name: tip, dtype: float64
gender
Female     87
Male      157
Name: tip, dtype: int64
gender
Female    246.51
Male      485.07
Name: tip, dtype: float64

In [26]:
#creating groups on multiple columns
df_grouped = df.groupby(['gender','day'])
mean_tip_by_gender = df_grouped['tip'].mean()
mean_tip_by_gender

gender  day
Female  Fri     2.781111
        Sat     2.801786
        Sun     3.367222
        Thur    2.575625
Male    Fri     2.693000
        Sat     3.083898
        Sun     3.220345
        Thur    2.980333
Name: tip, dtype: float64

In [28]:
#agg function
df_grouped = df.groupby(['gender','day']).agg({'tip':['mean','sum']}).reset_index()
df_grouped

   gender   day       tip
                     mean     sum
0  Female   Fri  2.781111   25.03
1  Female   Sat  2.801786   78.45
2  Female   Sun  3.367222   60.61
3  Female  Thur  2.575625   82.42
4    Male   Fri  2.693000   26.93
5    Male   Sat  3.083898  181.95
6    Male   Sun  3.220345  186.78
7    Male  Thur  2.980333   89.41

In [29]:
#Rename the columns for clarity
df_grouped.columns = ['gender','day','mean_tip','total_tip']
df_grouped

   gender   day  mean_tip  total_tip
0  Female   Fri  2.781111      25.03
1  Female   Sat  2.801786      78.45
2  Female   Sun  3.367222      60.61
3  Female  Thur  2.575625      82.42
4    Male   Fri  2.693000      26.93
5    Male   Sat  3.083898     181.95
6    Male   Sun  3.220345     186.78
7    Male  Thur  2.980333      89.41

In [30]:
# Directly glue together dataframes
data_one = {'A':['A0','A1','A2','A3'],'B':['B0','B1','B2','B3'] }
data_two = {'C':['C0','C1','C2','C3'],'D':['D0','D1','D2','D3'] }

one = pd.DataFrame(data_one)
two = pd.DataFrame(data_two)
print(one)
print(two)

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [31]:
#Concatenate along rows
axis0 = pd.concat([one,two],axis=0)
print(axis0)

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3   A3   B3  NaN  NaN
0  NaN  NaN   C0   D0
1  NaN  NaN   C1   D1
2  NaN  NaN   C2   D2
3  NaN  NaN   C3   D3

In [32]:
#concatenate along columns
axis1 = pd.concat([one,two],axis=1)
print(axis1)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [36]:
#How to bring them one below another
two.columns = one.columns
print(pd.concat([one,two]))

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [37]:
registrations = pd.DataFrame({'reg_id':[1,2,3,4], 'name': ['Alice','Bob','Carol', 'Dave']})
logins = pd.DataFrame({'log_id': [1,2,3,4], 'name': ['Xavier','Bob','Alice', 'Yolanda']})
print(registrations)
print(logins)

   reg_id   name
0       1  Alice
1       2    Bob
2       3  Carol
3       4   Dave
   log_id     name
0       1   Xavier
1       2      Bob
2       3    Alice
3       4  Yolanda

In [41]:
#Inner join (Intersection --> what is common between the two)
merged_df = pd.merge(registrations, logins, how='inner', on='name')
merged_df

   reg_id   name  log_id
0       1  Alice       3
1       2    Bob       2

In [43]:
#gives error if merged on the basis of a non-common column
# merged_df = pd.merge(registrations, logins, how='inner', on='reg_id')
# merged_df

In [44]:
#Left join
merged_df = pd.merge(registrations, logins, how='left') #everything from the left table is taken and (from right, only those which match with the left)
merged_df

   reg_id   name  log_id
0       1  Alice     3.0
1       2    Bob     2.0
2       3  Carol     NaN
3       4   Dave     NaN

In [45]:
#Right join
merged_df = pd.merge(registrations, logins, how='right') #everything from the right table is taken and (from left, only those which match with the right)
merged_df

   reg_id     name  log_id
0     NaN   Xavier       1
1     2.0      Bob       2
2     1.0    Alice       3
3     NaN  Yolanda       4

In [46]:
#Right join
merged_df = pd.merge(registrations, logins, how='outer')
merged_df

   reg_id     name  log_id
0     1.0    Alice     3.0
1     2.0      Bob     2.0
2     3.0    Carol     NaN
3     4.0     Dave     NaN
4     NaN   Xavier     1.0
5     NaN  Yolanda     4.0